import * as React from 'react';
import './Riznica.scss';
import {Parallax} from "react-scroll-parallax";
// import ModelCrkve from "../../components/riznica/ModelCrkve/ModelCrkve";
import {Box, Divider, Tooltip} from "@mui/material";
import {horizontalna_galerija, ipodjakon_galerija} from "client/const/galerija/const";
import Galerija from "client/components/layout/galerija/Galerija";
import Panorama from "client/components/riznica/Panorama/Panorama";
import RiznicaGalerija from "../../components/riznica/RiznicaGallery/RiznicaGallery";

// Assuming you have an array of image names in the directory

export default function Riznica() {

    return (
        <>
            <section className="riznica-hero">
                <Parallax speed={-60}>
                    <section id="hero-background" style={{margin: 0, padding: 0}}>
                        <div className="paralax-image" style={{
                            background: `url(assets/images/riznica/cover.jpg) center/cover`
                        }}>
                        </div>
                    </section>
                </Parallax>
                <div id="headline">
                    <h1>Ризница храма Св. цара Константина и царице Јелене</h1>
                </div>
            </section>
            <section className="three-d-model" id="o-hramu">
                <h2>Архитектура и историја цркве</h2>
                <Divider/>
                {/*<div className="grid-item">*/}
                {/*    <ModelCrkve/>*/}
                {/*</div>*/}
            </section>
            <Box component="div" className="riznica-content">
                <div className="grid-item">
                    <p>
                        Камено здање Вождовачке цркве неупадљиве величине и архитектуре, какво се често виђа код
                        нас, сакривено је на малој парцели окруженој високим зградама. Осим оних којима је то
                        парохијска црква, осталим Београђанима она углавном служи као оријентир у дугачким улицама
                        Војводе Степе и Јове Илића.
                    </p>
                    <p>
                        О њој би се могло писати као о просечној српској цркви ХХ века, само да није једног
                        изузетног детаља, који је чини једном од најзанимљивијих богомоља Србије, чуварем ремек-дела
                        уметности претходног столећа.
                    </p>
                    <p>
                        Данашње црквено здање друго је на овом месту. Прва црква изграђена је 1911. године, на
                        тадашњој далекој периферији Београда, тако забаченој да још наредне две деценије неће
                        доспети у планове града. Сиротиња која је ту живела – фијакеристи, ковачи, млекаџије,
                        радници и ситне занатлије - свакако себи не би могла приуштити грађење цркве, па се на тај
                        богоугодан потез одлучио трговац Јова Јовановић, који је цркви поклонио своје земљиште. Када
                        се, поведена његовим примером, овоме прикључила и Београдска општина са својим плацем,
                        добијено је довољно простора за храм и малу порту око њега, па се почело са зидањем.
                    </p>
                    <p>
                        Парохијани су издвајали од својих скромних примања, а додавали су они који су имали и више
                        него довољно, попут индустријалаца Ђорђа Вајферта и Јована Вшетечке, док је велико звоно за
                        још увек дрвену звонару купио извесни Пјетро Казагранде.
                        Када је завршено, било је то једнобродно здање сведених линија, са непропорционално малом
                        куполом права сеоска црквица, у складу са својим окружењем.
                    </p>
                    <p>Четири године по освећењу, црква је у рату девастирана, а њен скромни мобилијар опљачкан. У
                        послератном Београду, у којем је ваљало поправити много тога, обнова Вождовачке цркве дошла
                        је на ред тек 1926. године. Мала црква је после живела свој скромни живот све до 1970. Након
                        постепеног отопљавања односа цркве и државног руководства, приступа се обнови храмова, али и
                        изградњи нових тамо где их није било, или где су у Другом светском рату порушени.</p>
                    <p>Овај покрет водио је патријарх српски Герман, који је покренуо иницијативу да се и
                        Вождовачкој цркви, чија се парохија знатно увећала, да нови изглед. Током лета 1970. године
                        стара црква је корак по корак рушена, а нова је, према плановима архитекте Драгомира Тадића,
                        расла из старе. Иако на потпуно истој локацији, нови храм је знатно већи од свог
                        претходника, продужен за читавих седам метара ка западу. Нова грађевина је типична за радове
                        архитекте Тадића, који је сличне цркве подигао широм Југославије: ослањајући се на искуства
                        међуратних градитеља, Тадић се служио модернизованим речником средњовековних мајстора, са
                        доста лукова, бифора и обаве зном розетом над улазом. Главни украс цркве је звоник над
                        улазом, са завршетком у облику кубета. Све радове надгледао је и саветом помагао патријарх
                        лично.</p>
                    <p>По завршетку грађевинских радова прешло се на декорацију унутрашњости храма, па је под
                        поплочан студеничким мермером, а иконостас, рад охридских дрворезаца, осликао је академски
                        сликар Милосав Младеновић, који се водио средњовеков- ним узорима. Најлепши утисак оставља
                        мозаик у лунети над улазним вратима: по одабиру патријарха Германа, узет је предложак из
                        Цркве Светог Ахилија у Ариљу, па је по нацртима сликара Живка Стоисављевића ово вредно
                        уметничко дело израдио професор Антонио Орсини из Венеције.</p>
                    <p>Остало је још да се црква живопише. На ово се чекало до 1987. године, када је патријарх
                        Герман за то благословио Милића Станковића, познатијег као Милић од Мачве. Овај академски
                        сликар се до тог времена већ прочуо својим надреалистичким призорима, који су се храбро, и
                        за то доба врло неуобичајено, бавили темама из српске прошлости на врло директан начин.
                        Неконвенционалан у свему што је чинио, Милић од Мачве одлучио је да и у православни живопис
                        овог храма унесе новине тако што ће му дати свој особени печат. Тако на Тајној вечери лете
                        балвани, тај неизоставни мотив његових слика, а ликови живих вождовачких парохијана
                        подарени</p>
                </div>
                <div className="grid-item">
                    <Divider color="#fff" variant="fullWidth" sx={{margin: "0 auto", width: "90%"}}>
                        <h3>Иконе и фрескопис Вождовачке цркве</h3>
                    </Divider>
                    <RiznicaGalerija slides={horizontalna_galerija}/>
                </div>
                <Divider color="#fff" variant="fullWidth" id="parohijski-dom">
                    <h2>Живопис парохијског дома уз иконе ризнице Вождовачке цркве</h2>
                    <h3>- Дело и рад ипођакона Војислава Луковића -</h3>
                </Divider>
                <div className="grid-item">
                    <ol style={{color: "white"}}>
                        <li>
                            <p>Ове године Вождовачка црква је прославила јубилеј, 100 година од оснивања
                                храма. Том приликом је Патријарх србски, г.г.Иринеј освештао и нову свечану
                                салу парохијског дома и предао је верном народу на коришћење.
                                Источни зид свечане сале живописан је и дело је Војислава Луковића,
                                дипл.сликара.</p>
                        </li>
                        <li>
                            <p>
                                Зид површине око 30<i>м<sup>2</sup></i> подељен је по средини малом <Tooltip
                                title="aпсида (латински абсис од грчке ријечи ἁψίς - хапсис која значи »лук, свод«) је архитектонски елемент у црквеној архитектури. То је доградња, најчешће овалног или полукружног тлоцрта, са сводом у облику полукуполе (калоте)."><span
                                style={{
                                    display: "inline",
                                    textDecoration: "underline"
                                }}>апсидом</span></Tooltip> површине 10<i>м<sup>2</sup></i> са прозорским окном у
                                средини,
                                док се лево и десно налазе две једнаке зидне
                                површине од по 8<i>м<sup>2</sup></i>.
                            </p>
                        </li>
                        <li>
                            <p>У апсиди су осликани св.Цар Константин и Јелена, којима је црква и посвећена.
                                Уобичајено је да се они живопишу у стојећем ставу, како са по једном руком
                                придржавају крст, док другом руком показују на њега. Обзиром да се у овом
                                простору на средини налази прозорско окно, овакав начин изображавања није
                                могао бити примењен. Стога је искоришћен крстасти оквир који се налази у
                                прозору, који је позлаћен, и на њега са обе руке указују св.Цар Константин и
                                његова мајка Јелена. На тај начин се дошло до веома ефектног ликовног решења
                                које је у складу са канонским начином приказивања светог цара и његове мајке.
                                Изнад њих, у мандорли, благосиља их сам Господ Исус Христос у златној
                                одежди, док је испод прозора насликано постоље на коме се налази свитак са
                                текстом тропара <Tooltip
                                    title="Спаси, Господе, народ Свој, и благослови наслеђе Своје, православном и христољубивом роду нашем дарујући победу над противницима и Крстом Својим чувајући народ Твој."><span
                                    style={{
                                        display: "inline",
                                        textDecoration: "underline"
                                    }}>Часном крсту.</span></Tooltip></p>
                        </li>
                        <li>
                            <p>
                                На левој страни зида приказана је група са Србима светитељима.
                                С лева на десно, налазе се: св.Владика Николај Жички и Охридски, св.Сава
                                Србски и св.Василије Острошки, приказани у архијерејском одјејанију, у сакосу
                                са крстовима (тзв.“полиставрион“), и са Јеванђељима у рукама.
                                Св.Василије и св.Николај носе <Tooltip title="митра-круна коју носе Православни епископи. У употреби тек после пада
                                Цариграда, негде од шеснаестог века. Пре тога, почевши од 10. века, само је
                                Александријски патријарх носио митру, и то у облику обичне платнене капе.">
                            <span
                                style={{
                                    display: "inline",
                                    textDecoration: "underline"
                                }}>митру</span>
                            </Tooltip> (епископску круну) на глави, док је
                                Св.Сава је изображен са <Tooltip title="tonsurа (lat.) ≃ tondēre: brijati
                                обријано или ошишано теме главе у облику круга у знак примања монашког
                                пострига. Назива се још и гуменце (мало гумно). Уведена у хришћанство преко
                                египатских пустињака, тонзура је временом постала обавезна приликом
                                ступања у свештенство или монаштво (6. век). Од 9. до 15. века тонзура је на
                                православном истоку симболично тумачена као знак Христовог трновог венца
                                који свештеник и монах носе око главе. Чин примања тонзуре (од 16.века
                                замењен постржењем), има у монаштву дубоко значење— монаху се
                                постризавају власи главе у знак одрицања од света и свега што је у свету, у
                                знак одсецања сопствене воље и свих телесних похота. Готово сви српски
                                архијереји у Ариљу и Грачаници приказани су са тонзуром. Свети Сава је на
                                фрескама, иконама и минијатурама готово искључиво приказиван са тонзуром,
                                а у средњовековном фрескопису портрет српског епископа без тонзуре је права
                                реткост.">
                                    <span
                                        style={{
                                            display: "inline",
                                            textDecoration: "underline"
                                        }}>тонзуром</span>
                            </Tooltip>.
                            </p>
                        </li>
                        <li>
                            <p>
                                Св.Симеон Мироточиви који није био у свештеном чину приказан је као монах,
                                са кукуљицом на глави. Одевен у монашку ризу преко груди носи монашку <Tooltip
                                title="дугачко црно платно које се носи на грудима (код Грка са прорезом за главу, које се ставља око врата, а код Руса спојено са кукуљицом).">
                                    <span
                                        style={{
                                            display: "inline",
                                            textDecoration: "underline"
                                        }}>схиму</span>
                            </Tooltip>, преко које је пребачен <Tooltip title="параман- тканина у облику квадрата на којој је представљен Христов Крст са
                                                                    копљем, трском и сунђером-губом, са натписом: „На тијелу своме носим ране
                                                                    Господње“. По угловима је танким ужетом или траком причвршћен око рамена
                                                                    на леђима монаха, и служи да га подсећа да је на себе преузео Христов јарам и
                                                                    да мора да контролише своје страсти и жеље. означавајући да је он Христов
                                                                    следбеник.">
                                    <span
                                        style={{
                                            display: "inline",
                                            textDecoration: "underline"
                                        }}>параман</span>
                            </Tooltip>, заогрнут плаштом. У руци држи свитак на коме је написано: „Све што дише нека
                                хвали
                                Господа!“, што су последње речи које је изговорио предајући своју душу Господу.
                            </p>
                        </li>
                        <li>
                            <p>
                                На десном зиду приказани су свети оци Првог <Tooltip
                                title="васељенски сабор- сабрање епископа који представљају целу Цркву: колегијални начин на који се васељенски епископат изјашњава о садржајима вере и питањима дисциплине."><span
                                style={{
                                    display: "inline",
                                    textDecoration: "underline"
                                }}>Васељенског сабора</span></Tooltip> који је
                                одржан 325. године у Никеји (данас: Изник - Турска). Сазвао га је св.Цар
                                Константин који је приказан у средини, у владарској пурпурној одежди, са
                                царском круном на глави. Десном руком придржава текст са Оросом вере који
                                је установљен том приликом, а у левој руци држи штап-жезло на чијем врху се
                                налази Христов монограм.
                            </p>
                        </li>
                        <li>
                            <p>
                                Лево и десно од њега приказани су епископи који су учествовали на Сабору.
                                Обзиром да их је било <Tooltip
                                title="318 –Не зна се тачан број учесника, јер су многи долазили и одлазили током Сабора. У традицији је устаљен број од 318 учесника који има своје библијско упориште јер у &quot;Књизи постања&quot; (XИВ, 14) стоји записано: &quot;А кад Аврам чу да му се заробио синовац, наоружа слуге своје, триста осамнаест, који се родише у његовој кући и пође у потеру до Дана&quot;.)."><span
                                style={{
                                    display: "inline",
                                    textDecoration: "underline"
                                }}>318</span></Tooltip> на броју и да не могу сви да се прикажу на једном
                                месту, у иконопису се то представља са ореолима који се понављају у позадини
                                и означавају мноштво светитеља на једном месту.
                            </p>
                        </li>
                        <li>
                            <p>
                                У позадини обеју композиција приказане су грађевине, које означавају место
                                догађања, односно да се сцене одигравају у урбаној средини.
                                Испод сцена насликана је завеса, како је иначе уобичајено у живопису, на којој
                                се понавља мотив двоглавог орла владарске лозе Немањића.
                            </p>
                        </li>
                    </ol>
                </div>
                <Box component="div" sx={{width: "50%"}} className="grid-item">
                    <Galerija slides={ipodjakon_galerija}/>
                </Box>
                <div className="grid-item">
                </div>
            </Box>
            {/*<div>*/}
            {/*    <Panorama/>*/}
            {/*</div>*/}
        </>
    )
        ;
}